node {
  name: "input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 224
        }
        dim {
          size: 224
        }
        dim {
          size: 3
        }
      }
    }
  }
}
node {
  name: "v0/conv0/Pad/paddings"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000\003\000\000\000\003\000\000\000\003\000\000\000\003\000\000\000\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "v0/conv0/Pad"
  op: "Pad"
  input: "input"
  input: "v0/conv0/Pad/paddings"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tpaddings"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "v0/conv0/conv2d/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/conv0/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 7
        }
        dim {
          size: 7
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/conv0/conv2d/kernel/read"
  op: "Identity"
  input: "v0/conv0/conv2d/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/conv0/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v0/conv0/conv2d/Conv2D"
  op: "Conv2D"
  input: "v0/conv0/Pad"
  input: "v0/conv0/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "v0/conv0/batchnorm0/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/conv0/batchnorm0/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/conv0/batchnorm0/gamma/read"
  op: "Identity"
  input: "v0/conv0/batchnorm0/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/conv0/batchnorm0/gamma"
      }
    }
  }
}
node {
  name: "v0/conv0/batchnorm0/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/conv0/batchnorm0/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/conv0/batchnorm0/beta/read"
  op: "Identity"
  input: "v0/conv0/batchnorm0/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/conv0/batchnorm0/beta"
      }
    }
  }
}
node {
  name: "v0/conv0/batchnorm0/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/conv0/batchnorm0/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/conv0/batchnorm0/moving_mean/read"
  op: "Identity"
  input: "v0/conv0/batchnorm0/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/conv0/batchnorm0/moving_mean"
      }
    }
  }
}
node {
  name: "v0/conv0/batchnorm0/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/conv0/batchnorm0/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/conv0/batchnorm0/moving_variance/read"
  op: "Identity"
  input: "v0/conv0/batchnorm0/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/conv0/batchnorm0/moving_variance"
      }
    }
  }
}
node {
  name: "v0/conv0/batchnorm0/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "v0/conv0/conv2d/Conv2D"
  input: "v0/conv0/batchnorm0/gamma/read"
  input: "v0/conv0/batchnorm0/beta/read"
  input: "v0/conv0/batchnorm0/moving_mean/read"
  input: "v0/conv0/batchnorm0/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "v0/conv0/Relu"
  op: "Relu"
  input: "v0/conv0/batchnorm0/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "v0/mpool0/MaxPool"
  op: "MaxPool"
  input: "v0/conv0/Relu"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "ksize"
    value {
      list {
        i: 1
        i: 3
        i: 3
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "VALID"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 2
        i: 2
        i: 1
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv1/conv2d/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv1/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 64
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv1/conv2d/kernel/read"
  op: "Identity"
  input: "v0/resnet_v10/conv1/conv2d/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv1/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv1/conv2d/Conv2D"
  op: "Conv2D"
  input: "v0/mpool0/MaxPool"
  input: "v0/resnet_v10/conv1/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "v0/resnet_v10/conv1/batchnorm1/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv1/batchnorm1/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv1/batchnorm1/gamma/read"
  op: "Identity"
  input: "v0/resnet_v10/conv1/batchnorm1/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv1/batchnorm1/gamma"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv1/batchnorm1/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv1/batchnorm1/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv1/batchnorm1/beta/read"
  op: "Identity"
  input: "v0/resnet_v10/conv1/batchnorm1/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv1/batchnorm1/beta"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv1/batchnorm1/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv1/batchnorm1/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv1/batchnorm1/moving_mean/read"
  op: "Identity"
  input: "v0/resnet_v10/conv1/batchnorm1/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv1/batchnorm1/moving_mean"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv1/batchnorm1/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv1/batchnorm1/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv1/batchnorm1/moving_variance/read"
  op: "Identity"
  input: "v0/resnet_v10/conv1/batchnorm1/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv1/batchnorm1/moving_variance"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv1/batchnorm1/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "v0/resnet_v10/conv1/conv2d/Conv2D"
  input: "v0/resnet_v10/conv1/batchnorm1/gamma/read"
  input: "v0/resnet_v10/conv1/batchnorm1/beta/read"
  input: "v0/resnet_v10/conv1/batchnorm1/moving_mean/read"
  input: "v0/resnet_v10/conv1/batchnorm1/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "v0/resnet_v10/conv2/conv2d/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv2/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv2/conv2d/kernel/read"
  op: "Identity"
  input: "v0/resnet_v10/conv2/conv2d/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv2/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv2/conv2d/Conv2D"
  op: "Conv2D"
  input: "v0/mpool0/MaxPool"
  input: "v0/resnet_v10/conv2/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "v0/resnet_v10/conv2/batchnorm2/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv2/batchnorm2/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv2/batchnorm2/gamma/read"
  op: "Identity"
  input: "v0/resnet_v10/conv2/batchnorm2/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv2/batchnorm2/gamma"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv2/batchnorm2/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv2/batchnorm2/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv2/batchnorm2/beta/read"
  op: "Identity"
  input: "v0/resnet_v10/conv2/batchnorm2/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv2/batchnorm2/beta"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv2/batchnorm2/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv2/batchnorm2/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv2/batchnorm2/moving_mean/read"
  op: "Identity"
  input: "v0/resnet_v10/conv2/batchnorm2/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv2/batchnorm2/moving_mean"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv2/batchnorm2/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv2/batchnorm2/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv2/batchnorm2/moving_variance/read"
  op: "Identity"
  input: "v0/resnet_v10/conv2/batchnorm2/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv2/batchnorm2/moving_variance"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv2/batchnorm2/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "v0/resnet_v10/conv2/conv2d/Conv2D"
  input: "v0/resnet_v10/conv2/batchnorm2/gamma/read"
  input: "v0/resnet_v10/conv2/batchnorm2/beta/read"
  input: "v0/resnet_v10/conv2/batchnorm2/moving_mean/read"
  input: "v0/resnet_v10/conv2/batchnorm2/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "v0/resnet_v10/conv2/Relu"
  op: "Relu"
  input: "v0/resnet_v10/conv2/batchnorm2/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "v0/resnet_v10/conv3/conv2d/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv3/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv3/conv2d/kernel/read"
  op: "Identity"
  input: "v0/resnet_v10/conv3/conv2d/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv3/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv3/conv2d/Conv2D"
  op: "Conv2D"
  input: "v0/resnet_v10/conv2/Relu"
  input: "v0/resnet_v10/conv3/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "v0/resnet_v10/conv3/batchnorm3/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv3/batchnorm3/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv3/batchnorm3/gamma/read"
  op: "Identity"
  input: "v0/resnet_v10/conv3/batchnorm3/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv3/batchnorm3/gamma"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv3/batchnorm3/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv3/batchnorm3/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv3/batchnorm3/beta/read"
  op: "Identity"
  input: "v0/resnet_v10/conv3/batchnorm3/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv3/batchnorm3/beta"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv3/batchnorm3/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv3/batchnorm3/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv3/batchnorm3/moving_mean/read"
  op: "Identity"
  input: "v0/resnet_v10/conv3/batchnorm3/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv3/batchnorm3/moving_mean"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv3/batchnorm3/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv3/batchnorm3/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv3/batchnorm3/moving_variance/read"
  op: "Identity"
  input: "v0/resnet_v10/conv3/batchnorm3/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv3/batchnorm3/moving_variance"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv3/batchnorm3/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "v0/resnet_v10/conv3/conv2d/Conv2D"
  input: "v0/resnet_v10/conv3/batchnorm3/gamma/read"
  input: "v0/resnet_v10/conv3/batchnorm3/beta/read"
  input: "v0/resnet_v10/conv3/batchnorm3/moving_mean/read"
  input: "v0/resnet_v10/conv3/batchnorm3/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "v0/resnet_v10/conv3/Relu"
  op: "Relu"
  input: "v0/resnet_v10/conv3/batchnorm3/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "v0/resnet_v10/conv4/conv2d/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv4/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 64
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv4/conv2d/kernel/read"
  op: "Identity"
  input: "v0/resnet_v10/conv4/conv2d/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv4/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv4/conv2d/Conv2D"
  op: "Conv2D"
  input: "v0/resnet_v10/conv3/Relu"
  input: "v0/resnet_v10/conv4/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "v0/resnet_v10/conv4/batchnorm4/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv4/batchnorm4/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv4/batchnorm4/gamma/read"
  op: "Identity"
  input: "v0/resnet_v10/conv4/batchnorm4/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv4/batchnorm4/gamma"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv4/batchnorm4/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv4/batchnorm4/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv4/batchnorm4/beta/read"
  op: "Identity"
  input: "v0/resnet_v10/conv4/batchnorm4/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv4/batchnorm4/beta"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv4/batchnorm4/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv4/batchnorm4/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv4/batchnorm4/moving_mean/read"
  op: "Identity"
  input: "v0/resnet_v10/conv4/batchnorm4/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv4/batchnorm4/moving_mean"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv4/batchnorm4/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv4/batchnorm4/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v10/conv4/batchnorm4/moving_variance/read"
  op: "Identity"
  input: "v0/resnet_v10/conv4/batchnorm4/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v10/conv4/batchnorm4/moving_variance"
      }
    }
  }
}
node {
  name: "v0/resnet_v10/conv4/batchnorm4/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "v0/resnet_v10/conv4/conv2d/Conv2D"
  input: "v0/resnet_v10/conv4/batchnorm4/gamma/read"
  input: "v0/resnet_v10/conv4/batchnorm4/beta/read"
  input: "v0/resnet_v10/conv4/batchnorm4/moving_mean/read"
  input: "v0/resnet_v10/conv4/batchnorm4/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "v0/resnet_v10/AddN"
  op: "AddN"
  input: "v0/resnet_v10/conv1/batchnorm1/FusedBatchNorm"
  input: "v0/resnet_v10/conv4/batchnorm4/FusedBatchNorm"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "v0/resnet_v10/Relu"
  op: "Relu"
  input: "v0/resnet_v10/AddN"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "v0/resnet_v11/conv5/conv2d/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv5/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 256
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v11/conv5/conv2d/kernel/read"
  op: "Identity"
  input: "v0/resnet_v11/conv5/conv2d/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv5/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v0/resnet_v11/conv5/conv2d/Conv2D"
  op: "Conv2D"
  input: "v0/resnet_v10/Relu"
  input: "v0/resnet_v11/conv5/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "v0/resnet_v11/conv5/batchnorm5/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv5/batchnorm5/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v11/conv5/batchnorm5/gamma/read"
  op: "Identity"
  input: "v0/resnet_v11/conv5/batchnorm5/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv5/batchnorm5/gamma"
      }
    }
  }
}
node {
  name: "v0/resnet_v11/conv5/batchnorm5/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv5/batchnorm5/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v11/conv5/batchnorm5/beta/read"
  op: "Identity"
  input: "v0/resnet_v11/conv5/batchnorm5/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv5/batchnorm5/beta"
      }
    }
  }
}
node {
  name: "v0/resnet_v11/conv5/batchnorm5/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv5/batchnorm5/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v11/conv5/batchnorm5/moving_mean/read"
  op: "Identity"
  input: "v0/resnet_v11/conv5/batchnorm5/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv5/batchnorm5/moving_mean"
      }
    }
  }
}
node {
  name: "v0/resnet_v11/conv5/batchnorm5/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv5/batchnorm5/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v11/conv5/batchnorm5/moving_variance/read"
  op: "Identity"
  input: "v0/resnet_v11/conv5/batchnorm5/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv5/batchnorm5/moving_variance"
      }
    }
  }
}
node {
  name: "v0/resnet_v11/conv5/batchnorm5/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "v0/resnet_v11/conv5/conv2d/Conv2D"
  input: "v0/resnet_v11/conv5/batchnorm5/gamma/read"
  input: "v0/resnet_v11/conv5/batchnorm5/beta/read"
  input: "v0/resnet_v11/conv5/batchnorm5/moving_mean/read"
  input: "v0/resnet_v11/conv5/batchnorm5/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "v0/resnet_v11/conv5/Relu"
  op: "Relu"
  input: "v0/resnet_v11/conv5/batchnorm5/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "v0/resnet_v11/conv6/conv2d/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv6/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v11/conv6/conv2d/kernel/read"
  op: "Identity"
  input: "v0/resnet_v11/conv6/conv2d/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv6/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v0/resnet_v11/conv6/conv2d/Conv2D"
  op: "Conv2D"
  input: "v0/resnet_v11/conv5/Relu"
  input: "v0/resnet_v11/conv6/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "v0/resnet_v11/conv6/batchnorm6/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv6/batchnorm6/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v11/conv6/batchnorm6/gamma/read"
  op: "Identity"
  input: "v0/resnet_v11/conv6/batchnorm6/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv6/batchnorm6/gamma"
      }
    }
  }
}
node {
  name: "v0/resnet_v11/conv6/batchnorm6/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv6/batchnorm6/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v11/conv6/batchnorm6/beta/read"
  op: "Identity"
  input: "v0/resnet_v11/conv6/batchnorm6/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv6/batchnorm6/beta"
      }
    }
  }
}
node {
  name: "v0/resnet_v11/conv6/batchnorm6/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv6/batchnorm6/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v11/conv6/batchnorm6/moving_mean/read"
  op: "Identity"
  input: "v0/resnet_v11/conv6/batchnorm6/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv6/batchnorm6/moving_mean"
      }
    }
  }
}
node {
  name: "v0/resnet_v11/conv6/batchnorm6/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv6/batchnorm6/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v11/conv6/batchnorm6/moving_variance/read"
  op: "Identity"
  input: "v0/resnet_v11/conv6/batchnorm6/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv6/batchnorm6/moving_variance"
      }
    }
  }
}
node {
  name: "v0/resnet_v11/conv6/batchnorm6/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "v0/resnet_v11/conv6/conv2d/Conv2D"
  input: "v0/resnet_v11/conv6/batchnorm6/gamma/read"
  input: "v0/resnet_v11/conv6/batchnorm6/beta/read"
  input: "v0/resnet_v11/conv6/batchnorm6/moving_mean/read"
  input: "v0/resnet_v11/conv6/batchnorm6/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "v0/resnet_v11/conv6/Relu"
  op: "Relu"
  input: "v0/resnet_v11/conv6/batchnorm6/FusedBatchNorm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "v0/resnet_v11/conv7/conv2d/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv7/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 64
        }
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v11/conv7/conv2d/kernel/read"
  op: "Identity"
  input: "v0/resnet_v11/conv7/conv2d/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv7/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v0/resnet_v11/conv7/conv2d/Conv2D"
  op: "Conv2D"
  input: "v0/resnet_v11/conv6/Relu"
  input: "v0/resnet_v11/conv7/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "v0/resnet_v11/conv7/batchnorm7/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv7/batchnorm7/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v11/conv7/batchnorm7/gamma/read"
  op: "Identity"
  input: "v0/resnet_v11/conv7/batchnorm7/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv7/batchnorm7/gamma"
      }
    }
  }
}
node {
  name: "v0/resnet_v11/conv7/batchnorm7/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv7/batchnorm7/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v11/conv7/batchnorm7/beta/read"
  op: "Identity"
  input: "v0/resnet_v11/conv7/batchnorm7/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv7/batchnorm7/beta"
      }
    }
  }
}
node {
  name: "v0/resnet_v11/conv7/batchnorm7/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv7/batchnorm7/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v11/conv7/batchnorm7/moving_mean/read"
  op: "Identity"
  input: "v0/resnet_v11/conv7/batchnorm7/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv7/batchnorm7/moving_mean"
      }
    }
  }
}
node {
  name: "v0/resnet_v11/conv7/batchnorm7/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv7/batchnorm7/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 256
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v11/conv7/batchnorm7/moving_variance/read"
  op: "Identity"
  input: "v0/resnet_v11/conv7/batchnorm7/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v11/conv7/batchnorm7/moving_variance"
      }
    }
  }
}
node {
  name: "v0/resnet_v11/conv7/batchnorm7/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "v0/resnet_v11/conv7/conv2d/Conv2D"
  input: "v0/resnet_v11/conv7/batchnorm7/gamma/read"
  input: "v0/resnet_v11/conv7/batchnorm7/beta/read"
  input: "v0/resnet_v11/conv7/batchnorm7/moving_mean/read"
  input: "v0/resnet_v11/conv7/batchnorm7/moving_variance/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 1.00099996416e-05
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "v0/resnet_v11/AddN"
  op: "AddN"
  input: "v0/resnet_v10/Relu"
  input: "v0/resnet_v11/conv7/batchnorm7/FusedBatchNorm"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "v0/resnet_v11/Relu"
  op: "Relu"
  input: "v0/resnet_v11/AddN"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "v0/resnet_v12/conv8/conv2d/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v12/conv8/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 1
        }
        dim {
          size: 256
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "v0/resnet_v12/conv8/conv2d/kernel/read"
  op: "Identity"
  input: "v0/resnet_v12/conv8/conv2d/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v12/conv8/conv2d/kernel"
      }
    }
  }
}
node {
  name: "v0/resnet_v12/conv8/conv2d/Conv2D"
  op: "Conv2D"
  input: "v0/resnet_v11/Relu"
  input: "v0/resnet_v12/conv8/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "dilations"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "v0/resnet_v12/conv8/batchnorm8/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@v0/resnet_v12/conv8/batchnorm8/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
